## Git合并单个文件时的命令：y,n,q,a,d,/,K,j,J,g,e,?

当我们使用Git做版本控制的时候，如果存在多个分支，我们需要把分支的文件合并到主分支上面，可以通过以下的方式进行合并。

```shell
# 切换到主分支
git checkout master
# 将dev分支的test.java合并到master分支
git checkout --patch dev test.java
```

但是呢，如果文件出现冲突或者分支有修改的区域要提交的时候，会出现下面这些话

`Apply this hunk to index and worktree [y,n,q,a,d,/,K,j,J,g,e,?]?  `

那么，这些字母都是什么意思呢？

y - 保存这个代码片段

n - 不保存这个代码片段

q - 离开，不保存这个代码片段以及其他代码片段

a - 保存文件中这个代码片段，以及文件后面出现的代码片段

d - 不保存文件中这个代码片段，以及文件后面出现的代码片段

g - 选择一个代码片段

/ - 通过正则查找代码片段

j - 跳过这个代码片段，并查看下一个跳过的代码片段

J - 跳过这个代码片段，查看下一个代码片段

k - 跳过这个代码片段，查看上一个跳过的代码片段

K - 跳过这个代码片段，查看上一个代码片段

s - 把当前的代码片段划分为更小的代码片段

e - 手动编辑当前的代码片段

? - 帮助信息
